In [ ]:
-Create title table
CREATE TABLE titles (
    title_id VARCHAR (15) NOT NULL PRIMARY KEY,
    title VARCHAR (45) NOT NULL
);

select * FROM titles;

-Create employees table
CREATE TABLE employees (
    emp_no integer NOT NULL PRIMARY KEY,
    emp_title_id character varying(15) NOT NULL,
    FOREIGN KEY (emp_title_id) REFERENCES titles(title_id),
    birth_date timestamp without time zone NOT NULL,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    sex VARCHAR(10),
    hire_date timestamp without time zone NOT NULL
);

select * FROM employees;

-Create department employees table
CREATE TABLE dept_emp (
    emp_no integer NOT NULL,
	FOREIGN KEY (emp_no) REFERENCES employees(emp_no),
    dept_no VARCHAR (15) NOT NULL,
	FOREIGN KEY (dept_no) REFERENCES department(dept_no),
	PRIMARY KEY (emp_no, dept_no)
);

select * FROM dept_emp;
DROP TABLE dept_emp;

-Create department table
CREATE TABLE department (
  dept_no VARCHAR (15) NOT NULL PRIMARY KEY,
  dept_name VARCHAR (45) NOT NULL
);

select * FROM department;

-Create department manager table
CREATE TABLE dept_manager (
    dept_no VARCHAR(15) NOT NULL,
	FOREIGN KEY (dept_no) REFERENCES department(dept_no),
    emp_no integer NOT NULL,
	FOREIGN KEY (emp_no) REFERENCES employees(emp_no),
	PRIMARY KEY (dept_no, emp_no)
);

select * FROM dept_manager;

-Create salaries table
CREATE TABLE salaries (
    emp_no integer NOT NULL PRIMARY KEY,
    FOREIGN KEY (emp_no) REFERENCES employees(emp_no),
    salary integer NOT NULL
);

select * FROM salaries;

In [ ]:
COPY titles FROM '/Users/jenniferrocha/Public/EmployeeSQL/titles.csv' DELIMITER ',' CSV HEADER;
COPY employees FROM '/Users/jenniferrocha/Public/EmployeeSQL/employees.csv' DELIMITER ',' CSV HEADER;
COPY department FROM '/Users/jenniferrocha/Public/EmployeeSQL/departments.csv' DELIMITER ',' CSV HEADER;
COPY dept_emp FROM '/Users/jenniferrocha/Public/EmployeeSQL/dept_emp.csv' DELIMITER ',' CSV HEADER;
COPY dept_manager FROM '/Users/jenniferrocha/Public/EmployeeSQL/dept_manager.csv' DELIMITER ',' CSV HEADER;
COPY salaries FROM '/Users/jenniferrocha/Public/EmployeeSQL/salaries.csv' DELIMITER ',' CSV HEADER;

In [ ]:
#employee number, last name, first name, sex, and salary.

SELECT ee.emp_no, ee.last_name, ee.first_name, ee.sex, s.salary
FROM employees ee
JOIN salaries s
ON (ee.emp_no = s.emp_no)

In [ ]:
#employees who were hired in 1986.

Select * FROM employees
WHERE hire_date BETWEEN '1986-01-01' AND '1986-12-31';

In [ ]:
#manager of each department with the following information: 
#department number, department name, the manager’s employee number, 
#last name, first name.
    
SELECT dm.dept_no, d.dept_name, dm.emp_no, ee.last_name, ee.first_name
FROM employees ee
JOIN dept_emp de
ON (ee.emp_no = de.emp_no)
    JOIN department d
    ON (de.dept_no = d.dept_no)
        JOIN dept_manager dm
        ON (ee.emp_no = dm.emp_no);

In [ ]:
#department of each employee with the following information: 
#employee number, last name, first name, and department name.

SELECT ee.emp_no, ee.last_name, ee.first_name, d.dept_name
FROM employees ee
JOIN dept_emp de
ON (ee.emp_no = de.emp_no)
    JOIN department d
    ON (de.dept_no = d.dept_no);

In [ ]:
#first name, last name, and sex for employees whose first name 
#is “Hercules” and last names begin with “B.”

SELECT first_name, last_name, sex
FROM employees ee
WHERE first_name = 'Hercules' AND last_name LIKE 'B%';

In [ ]:
#employees in the Sales department, including their employee number, 
#last name, first name, and department name.

SELECT ee.emp_no, ee.last_name, ee.first_name, d.dept_name
FROM employees ee
JOIN dept_emp de
ON (ee.emp_no = de.emp_no)
    JOIN department d
    ON (de.dept_no = d.dept_no)
    WHERE d.dept_name = 'Sales';

In [ ]:
#all employees in the Sales and Development departments, including 
#their employee number, last name, first name, and department name.

SELECT ee.emp_no, ee.last_name, ee.first_name, d.dept_name
FROM employees ee
JOIN dept_emp de
ON (ee.emp_no = de.emp_no)
    JOIN department d
    ON (de.dept_no = d.dept_no)
    WHERE d.dept_name = 'Sales' OR d.dept_name = 'Development';

In [ ]:
#descending order, list the frequency count of employee last names, i.e., 
#how many employees share each last name.

SELECT last_name, COUNT(last_name) AS "Last Names"
FROM employees
GROUP BY last_name
ORDER BY "Last Names" DESC;

In [ ]:
# For viewing table layout in QuickDBD 
employees as ee
-
emp_no PK
emp_title_id FK - titles.title_id
birth_date
first_name
last_name
sex
hire_date

dep_emp as de
-
de_key PK
emp_no FK -< ee.emp_no
dept_no FK - dept.dept_no

department as dept
-
dept_no PK
dept_name

dept_manager as dept_mgr
-
dm_key PK 
dept_no FK - dept.dept_no
emp_no FK -< ee.emp_no

salaries as sal
-
emp_no PK FK -< ee.emp_no
salary

titles as t
-
title_id PK
title

In [ ]:
https://stackoverflow.com/questions/9186741/sql-query-where-dates-year-is-year

In [18]:
from sqlalchemy import create_engine

In [28]:
engine = create_engine('postgresql://postgres:postgres@localhost:5432/Employee_DB')
connection = engine.connect()